In [ ]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.getOrCreate()
from pyspark.sql.types import StructType, StructField, StringType, IntegerType, DoubleType
from pyspark.sql.functions import col

In [ ]:
data = [
    (1, "Anita", 20, "F", "BCA", 85),
    (2, "Rohit", 21, "M", "BSc", 78),
    (3, "Priya", 19, "F", "BCom", 90),
    (4, "Karan", 22, "M", "BA", 65),
    (5, "Neha", 20, "F", "BSc", 72),
    (6, "Suresh", 23, "M", "BCA", 88),
    (7, "Divya", 21, "F", "BA", 69),
    (8, "Ajay", 20, "M", "BCom", 75),
    (9, "Sonia", 22, "F", "BCA", 92),
    (10, "Arjun", 19, "M", "BSc", 60),
    (11, "Meena", 20, "F", "BCom", 84),
    (12, "Raj", 21, "M", "BA", 70),
    (13, "Asha", 22, "F", "BSc", 73),
    (14, "Nikhil", 20, "M", "BCA", 79),
    (15, "Preeti", 23, "F", "BCom", 86),
    (16, "Manoj", 21, "M", "BA", 66),
    (17, "Swati", 20, "F", "BSc", 80),
    (18, "Deepak", 22, "M", "BCA", 74),
    (19, "Kavya", 19, "F", "BCom", 91),
    (20, "Imran", 23, "M", "BA", 58),
    (21, "Ritika", 21, "F", "BCA", 77),
    (22, "Amit", 22, "M", "BSc", 83),
    (23, "Sakshi", 20, "F", "BCom", 68),
    (24, "Vinay", 21, "M", "BA", 61),
    (25, "Pooja", 22, "F", "BSc", 87),
    (26, "Anil", 20, "M", "BCA", 90),
    (27, "Rekha", 19, "F", "BA", 74),
    (28, "Tushar", 23, "M", "BCom", 82),
    (29, "Sneha", 21, "F", "BSc", 76),
    (30, "Ravi", 22, "M", "BCA", 88)
]

In [ ]:
schema = StructType([
    StructField("student_id", IntegerType(), True),
    StructField("name", StringType(), True),
    StructField("age", IntegerType(), True),
    StructField("gender", StringType(), True),
    StructField("course", StringType(), True),
    StructField("marks", IntegerType(), True)
])

# Create DataFrame
df = spark.createDataFrame(data, schema)

In [ ]:
df.show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|         1| Anita| 20|     F|   BCA|   85|
|         2| Rohit| 21|     M|   BSc|   78|
|         3| Priya| 19|     F|  BCom|   90|
|         4| Karan| 22|     M|    BA|   65|
|         5|  Neha| 20|     F|   BSc|   72|
|         6|Suresh| 23|     M|   BCA|   88|
|         7| Divya| 21|     F|    BA|   69|
|         8|  Ajay| 20|     M|  BCom|   75|
|         9| Sonia| 22|     F|   BCA|   92|
|        10| Arjun| 19|     M|   BSc|   60|
|        11| Meena| 20|     F|  BCom|   84|
|        12|   Raj| 21|     M|    BA|   70|
|        13|  Asha| 22|     F|   BSc|   73|
|        14|Nikhil| 20|     M|   BCA|   79|
|        15|Preeti| 23|     F|  BCom|   86|
|        16| Manoj| 21|     M|    BA|   66|
|        17| Swati| 20|     F|   BSc|   80|
|        18|Deepak| 22|     M|   BCA|   74|
|        19| Kavya| 19|     F|  BCom|   91|
|        20| Imran| 23|     M|    BA|   58|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
#sorting
df.orderBy("marks", ascending=True).show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|        20| Imran| 23|     M|    BA|   58|
|        10| Arjun| 19|     M|   BSc|   60|
|        24| Vinay| 21|     M|    BA|   61|
|         4| Karan| 22|     M|    BA|   65|
|        16| Manoj| 21|     M|    BA|   66|
|        23|Sakshi| 20|     F|  BCom|   68|
|         7| Divya| 21|     F|    BA|   69|
|        12|   Raj| 21|     M|    BA|   70|
|         5|  Neha| 20|     F|   BSc|   72|
|        13|  Asha| 22|     F|   BSc|   73|
|        18|Deepak| 22|     M|   BCA|   74|
|        27| Rekha| 19|     F|    BA|   74|
|         8|  Ajay| 20|     M|  BCom|   75|
|        29| Sneha| 21|     F|   BSc|   76|
|        21|Ritika| 21|     F|   BCA|   77|
|         2| Rohit| 21|     M|   BSc|   78|
|        14|Nikhil| 20|     M|   BCA|   79|
|        17| Swati| 20|     F|   BSc|   80|
|        28|Tushar| 23|     M|  BCom|   82|
|        22|  Amit| 22|     M|   BSc|   83|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
df.orderBy("age").show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|        19| Kavya| 19|     F|  BCom|   91|
|         3| Priya| 19|     F|  BCom|   90|
|        27| Rekha| 19|     F|    BA|   74|
|        10| Arjun| 19|     M|   BSc|   60|
|        17| Swati| 20|     F|   BSc|   80|
|         1| Anita| 20|     F|   BCA|   85|
|        23|Sakshi| 20|     F|  BCom|   68|
|         5|  Neha| 20|     F|   BSc|   72|
|        26|  Anil| 20|     M|   BCA|   90|
|         8|  Ajay| 20|     M|  BCom|   75|
|        11| Meena| 20|     F|  BCom|   84|
|        14|Nikhil| 20|     M|   BCA|   79|
|        16| Manoj| 21|     M|    BA|   66|
|         2| Rohit| 21|     M|   BSc|   78|
|        21|Ritika| 21|     F|   BCA|   77|
|         7| Divya| 21|     F|    BA|   69|
|        24| Vinay| 21|     M|    BA|   61|
|        12|   Raj| 21|     M|    BA|   70|
|        29| Sneha| 21|     F|   BSc|   76|
|         4| Karan| 22|     M|    BA|   65|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
df.orderBy("course", col("marks").desc()).show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|        27| Rekha| 19|     F|    BA|   74|
|        12|   Raj| 21|     M|    BA|   70|
|         7| Divya| 21|     F|    BA|   69|
|        16| Manoj| 21|     M|    BA|   66|
|         4| Karan| 22|     M|    BA|   65|
|        24| Vinay| 21|     M|    BA|   61|
|        20| Imran| 23|     M|    BA|   58|
|         9| Sonia| 22|     F|   BCA|   92|
|        26|  Anil| 20|     M|   BCA|   90|
|         6|Suresh| 23|     M|   BCA|   88|
|        30|  Ravi| 22|     M|   BCA|   88|
|         1| Anita| 20|     F|   BCA|   85|
|        14|Nikhil| 20|     M|   BCA|   79|
|        21|Ritika| 21|     F|   BCA|   77|
|        18|Deepak| 22|     M|   BCA|   74|
|        19| Kavya| 19|     F|  BCom|   91|
|         3| Priya| 19|     F|  BCom|   90|
|        15|Preeti| 23|     F|  BCom|   86|
|        11| Meena| 20|     F|  BCom|   84|
|        28|Tushar| 23|     M|  BCom|   82|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
df.orderBy("name").show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|         8|  Ajay| 20|     M|  BCom|   75|
|        22|  Amit| 22|     M|   BSc|   83|
|        26|  Anil| 20|     M|   BCA|   90|
|         1| Anita| 20|     F|   BCA|   85|
|        10| Arjun| 19|     M|   BSc|   60|
|        13|  Asha| 22|     F|   BSc|   73|
|        18|Deepak| 22|     M|   BCA|   74|
|         7| Divya| 21|     F|    BA|   69|
|        20| Imran| 23|     M|    BA|   58|
|         4| Karan| 22|     M|    BA|   65|
|        19| Kavya| 19|     F|  BCom|   91|
|        16| Manoj| 21|     M|    BA|   66|
|        11| Meena| 20|     F|  BCom|   84|
|         5|  Neha| 20|     F|   BSc|   72|
|        14|Nikhil| 20|     M|   BCA|   79|
|        25| Pooja| 22|     F|   BSc|   87|
|        15|Preeti| 23|     F|  BCom|   86|
|         3| Priya| 19|     F|  BCom|   90|
|        12|   Raj| 21|     M|    BA|   70|
|        30|  Ravi| 22|     M|   BCA|   88|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
df.orderBy("course", "marks").show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|        20| Imran| 23|     M|    BA|   58|
|        24| Vinay| 21|     M|    BA|   61|
|         4| Karan| 22|     M|    BA|   65|
|        16| Manoj| 21|     M|    BA|   66|
|         7| Divya| 21|     F|    BA|   69|
|        12|   Raj| 21|     M|    BA|   70|
|        27| Rekha| 19|     F|    BA|   74|
|        18|Deepak| 22|     M|   BCA|   74|
|        21|Ritika| 21|     F|   BCA|   77|
|        14|Nikhil| 20|     M|   BCA|   79|
|         1| Anita| 20|     F|   BCA|   85|
|        30|  Ravi| 22|     M|   BCA|   88|
|         6|Suresh| 23|     M|   BCA|   88|
|        26|  Anil| 20|     M|   BCA|   90|
|         9| Sonia| 22|     F|   BCA|   92|
|        23|Sakshi| 20|     F|  BCom|   68|
|         8|  Ajay| 20|     M|  BCom|   75|
|        28|Tushar| 23|     M|  BCom|   82|
|        11| Meena| 20|     F|  BCom|   84|
|        15|Preeti| 23|     F|  BCom|   86|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
df.sort("student_id").show()

+----------+------+---+------+------+-----+
|student_id|  name|age|gender|course|marks|
+----------+------+---+------+------+-----+
|         1| Anita| 20|     F|   BCA|   85|
|         2| Rohit| 21|     M|   BSc|   78|
|         3| Priya| 19|     F|  BCom|   90|
|         4| Karan| 22|     M|    BA|   65|
|         5|  Neha| 20|     F|   BSc|   72|
|         6|Suresh| 23|     M|   BCA|   88|
|         7| Divya| 21|     F|    BA|   69|
|         8|  Ajay| 20|     M|  BCom|   75|
|         9| Sonia| 22|     F|   BCA|   92|
|        10| Arjun| 19|     M|   BSc|   60|
|        11| Meena| 20|     F|  BCom|   84|
|        12|   Raj| 21|     M|    BA|   70|
|        13|  Asha| 22|     F|   BSc|   73|
|        14|Nikhil| 20|     M|   BCA|   79|
|        15|Preeti| 23|     F|  BCom|   86|
|        16| Manoj| 21|     M|    BA|   66|
|        17| Swati| 20|     F|   BSc|   80|
|        18|Deepak| 22|     M|   BCA|   74|
|        19| Kavya| 19|     F|  BCom|   91|
|        20| Imran| 23|     M|    BA|   58|
+----------+------+---+------+------+-----+
only showing top 20 rows

In [ ]:
# Registering the DataFrame as a SQL temporary view
df.createOrReplaceTempView("EMP")

In [ ]:
spark.sql("""
    SELECT student_id, name, gender, course, marks
    FROM EMP
    ORDER BY course ASC, marks DESC
""").show(truncate=False)

+----------+------+------+------+-----+
|student_id|name  |gender|course|marks|
+----------+------+------+------+-----+
|27        |Rekha |F     |BA    |74   |
|12        |Raj   |M     |BA    |70   |
|7         |Divya |F     |BA    |69   |
|16        |Manoj |M     |BA    |66   |
|4         |Karan |M     |BA    |65   |
|24        |Vinay |M     |BA    |61   |
|20        |Imran |M     |BA    |58   |
|9         |Sonia |F     |BCA   |92   |
|26        |Anil  |M     |BCA   |90   |
|6         |Suresh|M     |BCA   |88   |
|30        |Ravi  |M     |BCA   |88   |
|1         |Anita |F     |BCA   |85   |
|14        |Nikhil|M     |BCA   |79   |
|21        |Ritika|F     |BCA   |77   |
|18        |Deepak|M     |BCA   |74   |
|19        |Kavya |F     |BCom  |91   |
|3         |Priya |F     |BCom  |90   |
|15        |Preeti|F     |BCom  |86   |
|11        |Meena |F     |BCom  |84   |
|28        |Tushar|M     |BCom  |82   |
+----------+------+------+------+-----+
only showing top 20 rows

In [ ]:
#Group by Course – average marks  of Students
spark.sql("""
    SELECT course, AVG(marks) AS avg_marks
    FROM EMP
    GROUP BY course
""").show()

+------+-----------------+
|course|        avg_marks|
+------+-----------------+
|  BCom|82.28571428571429|
|    BA|66.14285714285714|
|   BSc|           76.125|
|   BCA|           84.125|
+------+-----------------+

In [ ]:
#Group by Gender – Max Marks
spark.sql("""
    SELECT gender, MAX(marks) AS highest_mark
    FROM EMP
    GROUP BY gender
""").show()

+------+------------+
|gender|highest_mark|
+------+------------+
|     F|          92|
|     M|          90|
+------+------------+

In [ ]:
#Group by gender – average of marks
spark.sql("""
    SELECT gender, AVG(marks)
    FROM EMP
    GROUP BY gender
""").show()

+------+-----------------+
|gender|       avg(marks)|
+------+-----------------+
|     F|80.26666666666667|
|     M|74.46666666666667|
+------+-----------------+

In [ ]:
#Group by Course and Gender – Average Marks
spark.sql("""
    SELECT course, gender, AVG(marks) AS avg_marks
    FROM EMP
    GROUP BY course, gender
""").show()

+------+------+-----------------+
|course|gender|        avg_marks|
+------+------+-----------------+
|  BCom|     F|             83.8|
|   BCA|     F|84.66666666666667|
|   BSc|     F|             77.6|
|    BA|     M|             64.0|
|   BSc|     M|73.66666666666667|
|   BCA|     M|             83.8|
|    BA|     F|             71.5|
|  BCom|     M|             78.5|
+------+------+-----------------+

In [ ]:
#Group by Age – Total Marks
spark.sql("""
    SELECT age, SUM(marks) AS total_marks
    FROM EMP
    GROUP BY age
""").show()

+---+-----------+
|age|total_marks|
+---+-----------+
| 22|        562|
| 20|        633|
| 19|        315|
| 23|        314|
| 21|        497|
+---+-----------+

In [ ]:
#Group by Course – Min & Max Marks
spark.sql("""
    SELECT course, MIN(marks) AS min_marks, MAX(marks) AS max_marks
    FROM EMP
    GROUP BY course
""").show()

+------+---------+---------+
|course|min_marks|max_marks|
+------+---------+---------+
|  BCom|       68|       91|
|    BA|       58|       74|
|   BSc|       60|       87|
|   BCA|       74|       92|
+------+---------+---------+

In [ ]:
#Count Students per Course
spark.sql("SELECT course, COUNT(*) AS course_count FROM EMP GROUP BY course").show()

+------+------------+
|course|course_count|
+------+------------+
|  BCom|           7|
|    BA|           7|
|   BSc|           8|
|   BCA|           8|
+------+------------+

In [ ]:
 #Count Students by Gender
 spark.sql("SELECT gender, COUNT(*) AS gender_count FROM EMP GROUP BY gender").show()

+------+------------+
|gender|gender_count|
+------+------------+
|     F|          15|
|     M|          15|
+------+------------+